# Pandas [for numerical data & Time series analysis]

In [2]:
import pandas as pd

In [4]:
city1=pd.Series([12,-6,8,-3])  #series can take any number of variables with one dimension
city1

0    12
1    -6
2     8
3    -3
dtype: int64

In [5]:
city1.values

array([12, -6,  8, -3], dtype=int64)

In [6]:
city1.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
city1.dtype

dtype('int64')

In [9]:
city2=pd.Series([12,-6,8,3],index=['day1','day2','day3','day4'])
city2

day1    12
day2    -6
day3     8
day4     3
dtype: int64

In [11]:
city2['day3']

8

In [12]:
city2[['day1','day2']]

day1    12
day2    -6
dtype: int64

In [13]:
city2>0

day1     True
day2    False
day3     True
day4     True
dtype: bool

In [14]:
city2[city2>0]

day1    12
day3     8
day4     3
dtype: int64

In [15]:
city2.min()

-6

In [16]:
city2.max()

12

In [17]:
city2[(city2>2)&(city2<9)]

day3    8
day4    3
dtype: int64

In [19]:
city2+3

day1    15
day2    -3
day3    11
day4     6
dtype: int64

In [20]:
data={'Kerala':28,'Andhra':25,'TN':31,'Karnataka':19,'Delhi':38}

In [22]:
data=pd.Series(data)
data

Kerala       28
Andhra       25
TN           31
Karnataka    19
Delhi        38
dtype: int64

In [26]:
States=['Andhra','Delhi','TN','MP','Kerala','Karnataka']
city3=pd.Series(data,index=States)
city3

Andhra       25.0
Delhi        38.0
TN           31.0
MP            NaN
Kerala       28.0
Karnataka    19.0
dtype: float64

In [27]:
city3.isna()

Andhra       False
Delhi        False
TN           False
MP            True
Kerala       False
Karnataka    False
dtype: bool

In [28]:
city3[city3.isna()]

MP   NaN
dtype: float64

In [29]:
city3[city3.notna()]

Andhra       25.0
Delhi        38.0
TN           31.0
Kerala       28.0
Karnataka    19.0
dtype: float64

# Data frame [collection of series]

In [30]:
data={'Year':[2110,2002,2003,2004,2005],'States':['Kerala','TN','Andhra','Goa','MP'],'Pop':[300,250,600,450,350]}
data

{'Year': [2110, 2002, 2003, 2004, 2005],
 'States': ['Kerala', 'TN', 'Andhra', 'Goa', 'MP'],
 'Pop': [300, 250, 600, 450, 350]}

In [31]:
pop_data=pd.DataFrame(data)
pop_data

   Year  States  Pop
0  2110  Kerala  300
1  2002      TN  250
2  2003  Andhra  600
3  2004     Goa  450
4  2005      MP  350

In [33]:
pop_data['Income']=[30000,25000,40000,60000,35000]
pop_data

   Year  States  Pop  Income
0  2110  Kerala  300   30000
1  2002      TN  250   25000
2  2003  Andhra  600   40000
3  2004     Goa  450   60000
4  2005      MP  350   35000

In [35]:
pop_data['Debt']=[600,750,260,580,900]
pop_data

   Year  States  Pop  Income  Debt
0  2110  Kerala  300   30000   600
1  2002      TN  250   25000   750
2  2003  Andhra  600   40000   260
3  2004     Goa  450   60000   580
4  2005      MP  350   35000   900

In [36]:
pop_data['Savings']=pop_data['Income']-pop_data['Debt']
pop_data

   Year  States  Pop  Income  Debt  Savings
0  2110  Kerala  300   30000   600    29400
1  2002      TN  250   25000   750    24250
2  2003  Andhra  600   40000   260    39740
3  2004     Goa  450   60000   580    59420
4  2005      MP  350   35000   900    34100

In [37]:
del pop_data['Pop']
pop_data

   Year  States  Income  Debt  Savings
0  2110  Kerala   30000   600    29400
1  2002      TN   25000   750    24250
2  2003  Andhra   40000   260    39740
3  2004     Goa   60000   580    59420
4  2005      MP   35000   900    34100

In [39]:
pop_data=pop_data.drop('Year',axis=1)
pop_data

   States  Income  Debt  Savings
0  Kerala   30000   600    29400
1      TN   25000   750    24250
2  Andhra   40000   260    39740
3     Goa   60000   580    59420
4      MP   35000   900    34100

In [40]:
pop_data.ndim

2

In [41]:
pop_data.size

20

importing csv files to python . [Note that both the files should be in the ssame folder, otherwise have to specify the parh]

In [5]:
import pandas as pd
auto_data=pd.read_csv('auto-mpg.csv')
auto_data

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86,2790,15.6,82,1,ford mustang gl
394,44.0,4,97.0,52,2130,24.6,82,2,vw pickup
395,32.0,4,135.0,84,2295,11.6,82,1,dodge rampage
396,28.0,4,120.0,79,2625,18.6,82,1,ford ranger
397,31.0,4,119.0,82,2720,19.4,82,1,chevy s-10